/*  Copyright (s) 2019 深圳百问网科技有限公司
 *  All rights reserved
 * 
 * 文件名称：main.c
 * 摘要：
 *  
 * 修改历史     版本号       Author       修改内容
 *--------------------------------------------------
 * 2020.6.6      v01        百问科技      创建文件
 *--------------------------------------------------
*/
#include "main.h"

int main(void)
{    
    //uint32_t sys_clk = 0;
    // 初始化HAL库函数必须要调用此函数
    HAL_Init();

    /*
     * 系统时钟即AHB/APB时钟配置
     * 当使用内部高速时钟HSE（8MHz）配置系统时钟时，使用PLL前可以选择不分频或者二分频，我们要配置到最大72MHz的系统频率此处当然是不分频
     * 然后经过一个放大器，最大放大倍数为16，我们要想得到72MHz，此处选择9倍放大系数，即8*9=72MHz即可达到目标
    */
    SystemClock_Config();
    

    while(1)
    {
    }
}

/*
 *  函数名：void Error_Handler(void)
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
 *  函数作用：程序错误处理函数，此处暂时设为死循环，不做任何动作
*/
void Error_Handler(void)
{
    while(1)
    {
    }
}
